Revit 2027 API
AlignmentStationLabelOptions.LeaderEnd Property
 Specifies the leader end point, in model coordinates. The default value is null. When null, the end point will be the same as the Origin point, driven by the Station value.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LeaderEnd { get; set; }
Public Property LeaderEnd As XYZ
	Get
	Set
public:
property XYZ^ LeaderEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LeaderEnd : XYZ with get, set
Property Value
XYZ
See Also
Reference
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace